In [1]:
import pandas as pd
import numpy as np
import yaml
pd.__version__

data = pd.read_csv('uk-500.csv')

# tutorial

* api：https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html

In [2]:
import torch
a = torch.Tensor([1, 2, 3, 4])
print(a.squeeze(), a.squeeze().size())

a = torch.Tensor([1])
print(a.squeeze(), a.squeeze().size())
torch.squeeze

a = torch.Tensor([[1]])
print(a.squeeze(), a.squeeze(dim=-1).size())

tensor([1., 2., 3., 4.]) torch.Size([4])
tensor(1.) torch.Size([])
tensor(1.) torch.Size([1])

In [3]:
!jupyter lab paths

[LabPathApp] WARNING | Config option `kernel_spec_manager_class` not recognized by `LabPathApp`.
Application directory:   /home/jeffye/anaconda3/envs/py38/share/jupyter/lab
User Settings directory: /home/jeffye/.jupyter/lab/user-settings
Workspaces directory: /home/jeffye/.jupyter/lab/workspaces

# create dataframe

## create dataframe with different ways

In [4]:
# initialize list of lists
data = [['tom', 10], ['nick', 15], ['juli', 14]]
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])

# print dataframe.
df.loc

   Name  Age
0   tom   10
1  nick   15
2  juli   14

## Creating DataFrame from dict of narray/lists

In [7]:
# initialize data of lists. dict key is column
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}

# Create DataFrame
df = pd.DataFrame(data)
# Print the output.
df.head()

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

## Creates a indexes DataFrame using arrays.

In [8]:
# initialize data of lists.
data = {'Name':['Tom', 'Jack', 'nick', 'juli'],
        'marks':[99, 98, 95, 90]}
 
# Creates pandas DataFrame.
df = pd.DataFrame(data, index =['rank1',
                                'rank2',
                                'rank3',
                                'rank4'])
 
# print the data
df.tail(4)

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

## Creating Dataframe from list of dicts

In [3]:
# Initialize data to lists. "NaN" will be added automatically if having missing values
data = [{'a': 1, 'b': 2, 'c':3, 'd': 8},
        {'a':10, 'b': 20, 'c': 30}]
 
# Creates DataFrame.
df = pd.DataFrame(data)
 
# Print the data
df

    a   b   c    d
0   1   2   3  8.0
1  10  20  30  NaN

## Creating DataFrame using zip() function.

In [14]:
# List1
Name = ['tom', 'krish', 'nick', 'juli']
   
# List2
Age = [25, 30, 26, 22]
   
# get the list of tuples from two lists.
# and merge them by using zip().
list_of_tuples = list(zip(Name, Age))
   
# Assign data to tuples.
list_of_tuples 
 
# Converting lists of tuples into
# pandas Dataframe.
df = pd.DataFrame(list_of_tuples,
                  columns = ['Name', 'Age'])
    
# Print data.
df

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

## Creating DataFrame from Dicts of series.

In [16]:
# Initialize data to Dicts of series.
d = {'one' : pd.Series([10, 20, 30, 40],
                       index =['a', 'b', 'c', 'd']),
      'two' : pd.Series([10, 20, 30, 40],
                        index =['a', 'b', 'c', 'd'])}
 
# creates Dataframe.
df = pd.DataFrame(d)
 
# print the data.
df

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

## create Series

In [5]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

# check nan of row and columns

In [31]:
data = {'set_of_numbers': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan], 
       'column2': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan]}
df = pd.DataFrame(data)
print (df)

    set_of_numbers  column2
0              1.0      1.0
1              2.0      2.0
2              3.0      3.0
3              4.0      4.0
4              5.0      5.0
5              NaN      NaN
6              6.0      6.0
7              7.0      7.0
8              NaN      NaN
9              8.0      8.0
10             9.0      9.0
11            10.0     10.0
12             NaN      NaN

## Check for NaN under a single DataFrame column:

In [24]:
df['set_of_numbers'].isnull().values.any()

True

In [28]:
df['set_of_numbers'].isnull().sum()

3

In [35]:
df.isnull().head()

   set_of_numbers  column2
0           False    False
1           False    False
2           False    False
3           False    False
4           False    False

## ways of fill nan

- https://vimsky.com/zh-tw/examples/usage/python-pandas.DataFrame.fillna.html

## dropna

In [13]:
# Create a pandas DataFrame.
import pandas as pd
import numpy as np
technologies= {
    'Courses':["Spark","PySpark","Spark","Python","PySpark","Java"],
    'Fee' :[22000,25000,np.nan,np.nan,np.nan,np.nan],
    'Duration':['30days',np.nan,'30days','N/A', np.nan,np.nan]
          }
df = pd.DataFrame(technologies)
print(df)

   Courses      Fee Duration
0    Spark  22000.0   30days
1  PySpark  25000.0      NaN
2    Spark      NaN   30days
3   Python      NaN      N/A
4  PySpark      NaN      NaN
5     Java      NaN      NaN

In [14]:
# Using DataFrame.dropna() method drop all rows that have NAN/none.
df2=df.dropna()
print(df2)

  Courses      Fee Duration
0   Spark  22000.0   30days

# add a column

## change value of particular row and column

In [20]:
data = {'column1': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan], 
       'column2': [1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan]}
df = pd.DataFrame(data)
# df['column3'] = list(range(len(data['column1'])))
df['column3'] = 0


df.loc[[11, 12], 'column3'] = [1, 3]
df.drop(['column3'], axis=1, inplace=True)
df

    column1  column2
0       1.0      1.0
1       2.0      2.0
2       3.0      3.0
3       4.0      4.0
4       5.0      5.0
5       NaN      NaN
6       6.0      6.0
7       7.0      7.0
8       NaN      NaN
9       8.0      8.0
10      9.0      9.0
11     10.0     10.0
12      NaN      NaN

In [18]:
df.index[2]

2

# copy

## copy columns and also keep index

In [8]:
data = {"col1": [1, 2, 3], "col2": [4, 5, 6], "col3": [7, 8, 9]}
df = pd.DataFrame(data, index=['rank1', 'rank2', 'rank3'])
print(df.head())
selected_columns = df[["col1", "col2"]]

       col1  col2  col3
rank1     1     4     7
rank2     2     5     8
rank3     3     6     9

In [9]:
selected_columns

       col1  col2
rank1     1     4
rank2     2     5
rank3     3     6

## copy by merging multiple indices (tolist first)

In [40]:
new_df = df.loc[selected_columns.index[:2].tolist() + selected_columns.index[:2].tolist()]
new_df['col3'] = 9
new_df

       col1  col2  col3
rank1     1     4     9
rank2     2     5     9
rank1     1     4     9
rank2     2     5     9

# index

## reindex

## set a column as index

In [25]:
data.head()

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [26]:
data.set_index("last_name", inplace=True)
data.head()

,first_name,company_name,address,city,county,postal,phone1,phone2,email,web
last_name,,,,,,,,,,
Tomkiewicz,Aleshia,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
Zigomalas,Evan,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
Andrade,France,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
Mcwalters,Ulysses,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
Veness,Tyisha,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [32]:
data.loc['Veness']

first_name                              Tyisha
company_name                    Champagne Room
address                      5396 Forth Street
city                Greets Green and Lyng Ward
county                           West Midlands
postal                                 B70 9DT
phone1                            01547-429341
phone2                            01290-367248
email                tyisha.veness@hotmail.com
web             http://www.champagneroom.co.uk
Name: Veness, dtype: object

In [36]:
len(data.index)

500

# merge

* 适用于横向合并，纵向合并用concat，append

## merge 的方式（inner, outer, left, right)：

```
pd.merge(movies, ratings, on=['movie_id', 'title'], how='inner') # 拿到基于movie_id和title两列数值相同的行
   movie_id title description  user_id  rating time
0         1    t1          d1        1       5   t1
1         2    t2          d2        2       4   t2

pd.merge(movies, ratings, on=['movie_id', 'title'], how='outer') # 拿到两边所有的行，没有数据会被拉下，无法merge的列会被填上空值
   movie_id title description  user_id  rating time
0         1    t1          d1      1.0     5.0   t1
1         2    t2          d2      2.0     4.0   t2
2         3    t3          d3      NaN     NaN  NaN
3         5    t5          d5      NaN     NaN  NaN
4         7    t7          d7      NaN     NaN  NaN
5         4    t3         NaN      7.0     3.0   t4
6         5    t4         NaN      9.0     2.0   t4
7         6    t5         NaN     11.0     3.0   t1
8         7    t6         NaN     15.0     1.0   t3

pd.merge(movies, ratings, on=['movie_id', 'title'], how='left') # 存下左Dataframe所有数值，扔掉右DataFrame中不和左DataFrame重合的行（基于movie_id和title列）
   movie_id title description  user_id  rating time
0         1    t1          d1      1.0     5.0   t1
1         2    t2          d2      2.0     4.0   t2
2         3    t3          d3      NaN     NaN  NaN
3         5    t5          d5      NaN     NaN  NaN
4         7    t7          d7      NaN     NaN  NaN

pd.merge(movies, ratings, on=['movie_id', 'title'], how='right') # 和left join相反，存下右DataFrame所有的行，左DataFrame中不和右DataFrame重合的数据会被扔掉
   movie_id title description  user_id  rating time
0         1    t1          d1        1       5   t1
1         2    t2          d2        2       4   t2
2         4    t3         NaN        7       3   t4
3         5    t4         NaN        9       2   t4
4         6    t5         NaN       11       3   t1
5         7    t6         NaN       15       1   t3

pd.merge(movies, ratings, on=['movie_id', 'title'], how='outer', indicator=True) # 结果中会有一个额外的列_merge显性提示数据的情况
   movie_id title description  user_id  rating time      _merge
0         1    t1          d1      1.0     5.0   t1        both
1         2    t2          d2      2.0     4.0   t2        both
2         3    t3          d3      NaN     NaN  NaN   left_only
3         5    t5          d5      NaN     NaN  NaN   left_only
4         7    t7          d7      NaN     NaN  NaN   left_only
5         4    t3         NaN      7.0     3.0   t4  right_only
6         5    t4         NaN      9.0     2.0   t4  right_only
7         6    t5         NaN     11.0     3.0   t1  right_only
8         7    t6         NaN     15.0     1.0   t3  right_only

# 自定义indicator column的名称
pd.merge(movies, ratings, on=['movie_id', 'title'], how='outer', indicator='indicator_column')

   movie_id title description  user_id  rating time indicator_column
0         1    t1          d1      1.0     5.0   t1             both
1         2    t2          d2      2.0     4.0   t2             both
2         3    t3          d3      NaN     NaN  NaN        left_only
3         5    t5          d5      NaN     NaN  NaN        left_only
4         7    t7          d7      NaN     NaN  NaN        left_only
5         4    t3         NaN      7.0     3.0   t4       right_only
6         5    t4         NaN      9.0     2.0   t4       right_only
7         6    t5         NaN     11.0     3.0   t1       right_only
8         7    t6         NaN     15.0     1.0   t3       right_only
```

In [14]:
import numpy as np
import pandas as pd

movies = pd.DataFrame({
    'movie_id': [1, 2, 3, 5, 7],
    'title': ['t1', 't2', 't3', 't5', 't7'],
    'description': ['d1', 'd2', 'd3', 'd5', 'd7']
})

ratings = pd.DataFrame({
    'user_id': [1, 2, 7, 9, 11, 15],
    'movie_id': [1, 2, 4, 5, 6, 7],
    'title': ['t1', 't2', 't3', 't4', 't5', 't6'],
    'rating': [5, 4, 3, 2, 3, 1],
    'time': ['t1', 't2', 't4', 't4', 't1', 't3']
})

# 然后使用merge函数进行最基础的inner merge：
pd.merge(movies, ratings) # 自动基于相同名字的列(movie_id和title)进行inner join，只有同名列上数值相同的行才会被结合。

pd.merge(movies, ratings, on=['movie_id', 'title']) # 和上面的结果相同，通过on参数显性定义要join的列

pd.merge(movies, ratings, on=['movie_id']) # 只基于 movie_id 列进行结合

pd.merge(movies, ratings, left_on='movie_id', right_on='user_id') # 使用左dataframe的movie_id和右dataframe的user_id进行合并

pd.merge(movies, ratings, left_index=True, right_index=True) # 基于两边的index进行merge

# 如果要解决列名字重合（overlapping）的问题，可以使用suffixes参数来解决： 
output = pd.merge(movies, ratings, on=['movie_id'], suffixes=['_left', '_right'])
'''
   movie_id title_left description  user_id title_right  rating time
0         1         t1          d1        1          t1       5   t1
1         2         t2          d2        2          t2       4   t2
2         5         t5          d5        9          t4       2   t4
3         7         t7          d7       15          t6       1   t3
'''

output

   movie_id title description  user_id title_right  rating time
0         1    t1          d1        1          t1       5   t1
1         2    t2          d2        2          t2       4   t2
2         5    t5          d5        9          t4       2   t4
3         7    t7          d7       15          t6       1   t3

# join

# concat: 纵向合并

```
使用Concat实现纵向合并（将两个 DataFrame 按照水平方向叠起来）：

pd.concat([movies, ratings]) # 纵向结合两个DataFrame，index不会被reset
pd.concat([movies, ratings], ignore_index = True)  # index会被reset 
我们也能使用 concat 进行 inner join 和 outer join（没有left join和right join，default是outer join）：

pd.concat([movies, ratings], axis=1) # 将axis设为1后，可基于index进行outer join，但不是真正意义上的join，只是横向水平叠合
 movie_id title description  user_id  movie_id title  rating time
0       1.0    t1          d1        1         1    t1       5   t1
1       2.0    t2          d2        2         2    t2       4   t2
2       3.0    t3          d3        7         4    t3       3   t4
3       5.0    t5          d5        9         5    t4       2   t4
4       7.0    t7          d7       11         6    t5       3   t1
5       NaN   NaN         NaN       15         7    t6       1   t3

pd.concat([movies, ratings], join='inner', axis=1) # 基于index进行inner join

pd.concat([movies.set_index('movie_id'), ratings.set_index('movie_id')], join='inner', axis=1) # 基于movie_id进行inner join

pd.merge(movies, ratings, on='movie_id') # 执行结果和上面一样
```

# locate, slice

In [6]:
# Access multiple elements by providing label of index
import pandas as pd  
import numpy as np 
    
ser = pd.Series(np.arange(3, 9), index =['a', 'b', 'c', 'd', 'e', 'f']) 
    
print(ser[['a', 'd']])

a    3
d    6
dtype: int64

In [ ]:
# Access multiple elements by using multi-index
# _a.loc[:, ['CLOSE0', 'OPEN0', 'LOW0', 'VOLUME0', 'HIGH0']]

In [4]:
# <!-- sa = pd.Series([1, 2, 3], index=list('abc'))
import pandas as pd
sa = pd.Series([1, 2, 3])
sa.loc[[1, 2]]

1    2
2    3
dtype: int64

In [ ]:
import pandas as pd

data = [['tom', 10], ['nick', 15], ['juli', 14]]
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])
df.pipe

# iterate rows

## iterrows()

```python
for idx, row in major_stock_contract.iterrows():
    if row['vt_symbol'][0:3] not in ['600', '601', '603', '605', '000']:
        # print(row['name'], row['vt_symbol'])
        others_set.add(row['vt_symbol'][0:3])
```

# multi-index

## set multi index, and loc by both axis0 index and column names

In [16]:
import pandas as pd
 
# making data for dataframing
data = {
    'series': ['Peaky blinders', 'Sherlock', 'The crown',
               'Queens Gambit', 'Friends'],
     
    'Ratings': [4.5, 5, 3.9, 4.2, 5],
     
    'Date': [2013, 2010, 2016, 2020, 1994]
}
 
# Dataframing the whole data created
df = pd.DataFrame(data)
 
# setting first and the second name
# as index column
df.set_index(["series", "Ratings"], inplace=True, append=True, drop=False)
# display the dataframe
print(df)

                                  series  Ratings  Date
  series         Ratings
0 Peaky blinders 4.5      Peaky blinders      4.5  2013
1 Sherlock       5.0            Sherlock      5.0  2010
2 The crown      3.9           The crown      3.9  2016
3 Queens Gambit  4.2       Queens Gambit      4.2  2020
4 Friends        5.0             Friends      5.0  1994

In [17]:
print(df.index)

MultiIndex([(0, 'Peaky blinders', 4.5),
            (1,       'Sherlock', 5.0),
            (2,      'The crown', 3.9),
            (3,  'Queens Gambit', 4.2),
            (4,        'Friends', 5.0)],
           names=[None, 'series', 'Ratings'])

In [18]:
df.loc[:, ['series', 'Ratings']]

                                  series  Ratings
  series         Ratings
0 Peaky blinders 4.5      Peaky blinders      4.5
1 Sherlock       5.0            Sherlock      5.0
2 The crown      3.9           The crown      3.9
3 Queens Gambit  4.2       Queens Gambit      4.2
4 Friends        5.0             Friends      5.0

## locate multi-index index (row)

In [19]:
import pandas as pd
import numpy as np

arrays = [
    np.array(["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"]),
    np.array(["one", "two", "one", "two", "one", "two", "one", "two"]),
]
df = pd.DataFrame(np.random.randn(8, 4), index=arrays)
df

                0         1         2         3
bar one  0.725010 -1.015735 -1.172710 -0.367887
    two  1.254657  0.961418  0.276529  1.311037
baz one  1.568128 -0.215245 -0.051744 -1.550783
    two -0.539466  0.217325 -0.869516  0.227311
foo one  0.416601 -0.117201  0.454117 -1.017816
    two -0.619394  1.752729 -0.540516  1.722148
qux one  1.925168 -0.048767 -0.391424  0.956501
    two  0.299726  1.497214 -1.041282 -1.049099

In [20]:
# only one index value, use xs()
print(df.xs('one', level=1, axis=0, drop_level=False))
df.loc['bar']
# df.index

                0         1         2         3
bar one  0.725010 -1.015735 -1.172710 -0.367887
baz one  1.568128 -0.215245 -0.051744 -1.550783
foo one  0.416601 -0.117201  0.454117 -1.017816
qux one  1.925168 -0.048767 -0.391424  0.956501

            0         1         2         3
one  0.725010 -1.015735 -1.172710 -0.367887
two  1.254657  0.961418  0.276529  1.311037

In [21]:
# with two indices, not 2 different values for one level
df.loc[('bar', 'one')]

0    0.725010
1   -1.015735
2   -1.172710
3   -0.367887
Name: (bar, one), dtype: float64

In [25]:
# select by multiple values of a single level of index

df.loc[(slice(None), ['one', 'two']), :]
df.loc[pd.IndexSlice[:, ['one', 'two']], :]  # more readable

                0         1         2         3
bar one  0.725010 -1.015735 -1.172710 -0.367887
    two  1.254657  0.961418  0.276529  1.311037
baz one  1.568128 -0.215245 -0.051744 -1.550783
    two -0.539466  0.217325 -0.869516  0.227311
foo one  0.416601 -0.117201  0.454117 -1.017816
    two -0.619394  1.752729 -0.540516  1.722148
qux one  1.925168 -0.048767 -0.391424  0.956501
    two  0.299726  1.497214 -1.041282 -1.049099

## loc mulit-index columns (columns can be mulit-index)

In [25]:
# sample data
col = pd.MultiIndex.from_arrays([['one', 'one', 'one', 'two', 'two', 'two'],
                                ['a', 'b', 'c', 'a', 'b', 'c']])
data = pd.DataFrame(np.random.randn(4, 6), columns=col)
print(data.columns)
data

MultiIndex([('one', 'a'),
            ('one', 'b'),
            ('one', 'c'),
            ('two', 'a'),
            ('two', 'b'),
            ('two', 'c')],
           )

        one                           two
          a         b         c         a         b         c
0 -0.657913  0.400925  0.760172  0.725475 -0.558508  1.532651
1 -0.333657 -1.302942 -0.063007  2.693031 -1.640149  1.826936
2  0.992687  0.453391 -0.273192 -0.179452 -0.860489 -1.918615
3 -2.486774 -0.165280 -0.778476 -0.242463  0.832359  1.771344

In [24]:
print(data.loc[:, (['one'], ['a', 'b'])])
data.loc[:, (['one', 'two'], ['a', 'b'])]

        one
          a         b
0  0.463550 -0.130793
1 -0.079601  0.099634
2 -0.894837  0.776635
3 -0.415633 -0.352887

        one                 two
          a         b         a         b
0  0.463550 -0.130793  0.246485 -0.423790
1 -0.079601  0.099634 -1.253542 -0.334205
2 -0.894837  0.776635  1.209673  0.427424
3 -0.415633 -0.352887  0.572663  0.975099

In [23]:
data.loc[:, (slice(None), ["a", "b"])]

        one                 two
          a         b         a         b
0  0.463550 -0.130793  0.246485 -0.423790
1 -0.079601  0.099634 -1.253542 -0.334205
2 -0.894837  0.776635  1.209673  0.427424
3 -0.415633 -0.352887  0.572663  0.975099

In [26]:
data.loc[:, data.columns.get_level_values(1).isin(['a', 'b'])]

        one                 two
          a         b         a         b
0 -0.657913  0.400925  0.725475 -0.558508
1 -0.333657 -1.302942  2.693031 -1.640149
2  0.992687  0.453391 -0.179452 -0.860489
3 -2.486774 -0.165280 -0.242463  0.832359

In [27]:
data.iloc[:2].loc[:, data.columns.get_level_values(1).isin(['a', 'b'])]

        one                 two
          a         b         a         b
0 -0.657913  0.400925  0.725475 -0.558508
1 -0.333657 -1.302942  2.693031 -1.640149

In [31]:
data.loc(axis="columns")[:, ["a", "c"]]

        one                 two
          a         c         a         c
0 -0.657913  0.760172  0.725475  1.532651
1 -0.333657 -0.063007  2.693031  1.826936
2  0.992687 -0.273192 -0.179452 -1.918615
3 -2.486774 -0.778476 -0.242463  1.771344

# pandas datetime

In [32]:
import pandas as pd

series = pd.Series(['20010101', '20010331'])
dates = pd.to_datetime(series, format='%Y%m%d')
dates.dt.strftime('%Y-%m-%d')

0    2001-01-01
1    2001-03-31
dtype: object

In [34]:
dates.dt

## Timedelta

In [35]:
start_time = pd.to_datetime("2021-10-01") + pd.Timedelta(days=60)
print(start_time.strftime('%Y-%m-%d'))

2021-11-30

# selecting rows by conditions /filtering

## 多条件
* & | 
* 
### select where in
* isin

### not in 
* days = [0,1,2]
df[~df(days)]

In [3]:
# importing pandas
import pandas as pd

record = {

    'Name': ['Ankit', 'Amit', 'Aishwarya', 'Priyanka', 'Priya', 'Shaurya'],
    'Age': [21, 19, 20, 18, 17, 21],
    'Stream': ['Math', 'Commerce', 'Science', 'Math', 'Math', 'Science'],
    'Percentage': [21, 92, 95, 70, 65, 78]}

# create a dataframe
dataframe = pd.DataFrame(record, columns=['Name', 'Age', 'Stream', 'Percentage'])

print("Given Dataframe :\n", dataframe)

# selecting rows based on condition
rslt_df = dataframe[dataframe['Percentage'] != dataframe['Age']]
# rslt_df = dataframe[dataframe['Percentage'] > 80]

print('\nResult dataframe :\n', rslt_df)

## 多条件

# selecting rows based on condition
rslt_df = dataframe[(dataframe['Percentage'] != dataframe['Age']) & (dataframe['Percentage'] > 80)]
# or | 
print('\n多条件 :\n', rslt_df)

# isin
ages = [19, 21]

ret_df = dataframe.loc[~dataframe.Age.isin(ages)]
print('\nnot in ages [19, 21]:\n', ret_df)

Given Dataframe :
         Name  Age    Stream  Percentage
0      Ankit   21      Math          21
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

Result dataframe :
         Name  Age    Stream  Percentage
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95
3   Priyanka   18      Math          70
4      Priya   17      Math          65
5    Shaurya   21   Science          78

多条件 :
         Name  Age    Stream  Percentage
1       Amit   19  Commerce          92
2  Aishwarya   20   Science          95

not in ages [19, 21]:
         Name  Age   Stream  Percentage
2  Aishwarya   20  Science          95
3   Priyanka   18     Math          70
4      Priya   17     Math          65

## select rows with

### startswith

### match

### loc
* using index

In [16]:
# dataframe['Name'].str.contains("(Ankit|Amit)")
from pandas import Series


# 返回index Series
dataframe['Name'].str.startswith("A", na = False) # NAN 值处理。 

idx_series: pd.Series = dataframe['Name'].str.match("^(A|S)")
# 选择 
dataframe[idx_series]

options = ['Amit', 'Aishwary']

# selecting rows based on condition
rslt_df = dataframe.loc[~dataframe['Name'].isin(options)]

# 直接用row index 值也可以
dataframe.loc["viper"]

print(rslt_df)

   Name  Age    Stream  Percentage
1  Amit   19  Commerce          92

# selecting columns

## select single column as Series
```
df.loc()
```

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.random(size=(3, 4)))
df.columns = list('abcd')
df

          a         b         c         d
0  0.202522  0.673474  0.333137  0.796078
1  0.748068  0.824570  0.081145  0.320486
2  0.639537  0.536804  0.517097  0.179741

In [ ]:
# 方法1
df[['a', 'b']]

# 方法2
df.loc[:, ['b', 'c']]

# 方法3
df.iloc[:, 2:]

# 方法4
pd.read_csv('filepath.csv', usecols=['a', 'b', 'c'])

# filter

- filter 主要按条件选择列

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])

# 按名称选择列
df.filter(items=['one', 'three'])
'''
         one  three
mouse     1      3
rabbit    4      6
'''
# 按正则表达式选择列
df.filter(regex='e$', axis=1)
'''
         one  three
mouse     1      3
rabbit    4      6
'''
# 选择包含“bbi”的行
df.filter(like='bbi', axis=0)
'''
         one  two  three
rabbit    4    5      6
'''

df.filter(items=['Q1', 'Q2']) # 选择两列
df.filter(regex='Q', axis=1) # 列名包含Q的
df.filter(regex='e$', axis=1) # 以 e 结尾的
df.filter(regex='1$', axis=0) # 正则, 索引名包含1的
df.filter(like='2', axis=0) # 索引中有2的
# 索引中2开头列名有Q的
df.filter(regex='^2', axis=0).filter(like='Q', axis=1)

Empty DataFrame
Columns: []
Index: []

# sort

In [ ]:
import pandas as pd
data = [12,5,8,2,8,2,8,2,8,2,8,5,84]
data1 = [12,5,8,56,57,58,59,22,84,24,85,56,87]
df1=pd.DataFrame(data, columns=['num'])
df2=pd.DataFrame(data1, columns=['num'])
print(data1)
df=pd.DataFrame(data, columns=['num'])

df.sort_values(by=['num'], ascending=True, inplace=True) #1升序排序 0降序
#排序函数
df['cum']=df['num'].cumsum()
df['prod']=df['num'].cumprod()
print(df.sort_values(by=['num','cum'], ascending=[True, True]) ) #按多列排序

# map

```
df['col1'] = df['col1'].map(complex_function)

grouped_df.Survived = grouped_df.Survived.map({0: "Died", 1: "Survived",})
```

# transform

# apply

## 改变一列的值

```python
df1['trades'] = df1['trades'].apply(lambda x: x[0].direction if x else "N")
```

# drop

## drop rows on condition

```python
# mehtod1 
df_filtered = df[df['Age'] >= 25]

# method 2
indexAge = df[ (df['Age'] >= 20) & (df['Age'] <= 25) ].index
df.drop(indexAge , inplace=True)
df.head(15)
```

## drop columns

```python
def cleanColumns(df):
    for col in df.columns:
        if col[0:7] == "Unnamed":
        df.drop(col, inplace=True, axis=1)
    return df
```

In [2]:
# axis usage

import pandas as pd
import numpy as np

np.random.random([3, 4])

data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'bmi': [18., 19., 20., 25.],
        'Age': [20, 21, 19, 18]}

# Create DataFrame
df = pd.DataFrame(data)

def add_one(v):
    return v + 1

"""
axis : {0 or 'index', 1 or 'columns'}, default 0
    Axis along which the function is applied:

0 or 'index': apply function to each column.
1 or 'columns': apply function to each row.
"""
df['Age'] = df.apply(lambda x: add_one(x.Age), axis=1)

df

    Name   bmi  Age
0    Tom  18.0   21
1   nick  19.0   22
2  krish  20.0   20
3   jack  25.0   19

# groupby

## agg and rename

## 所有其它columns 都执行： sum

* df.groupby(by=['RepID','Week','CallCycleDay'], as_index=False).sum()

In [10]:
import pandas as pd

data = pd.DataFrame(
    dict(
        Pclass=[1, 1, 2, 2, 3, 3],
        Survived=[0, 1, 0, 1, 0, 1],
        CategorySize=[80, 136, 97, 87, 372, 119],
    )
)

grouped_df = data.groupby(by=["Pclass", "Survived"], as_index=False).agg(
    {"CategorySize": "sum"}
)
print("grouped by two columns and sum a column:\n", grouped_df)

# can also use lambda func for aggregation.
grouped_df = data.groupby(by=["Pclass"], as_index=False).agg(
    {"CategorySize": "sum", "Survived": "sum"}
)
print(grouped_df)

# rename
grouped_df = data.groupby(by=["Pclass"], as_index=False).agg(min_height=('CategorySize', 'min'), 
                               max_weight=('CategorySize', 'max'))
print(grouped_df)

## agg and rename
'''
df_group = merged_df.groupby(by=['市值'], as_index=False).agg(
    pnl_positive_count=('total_net_pnl', add_large_zero),
    pnl_negative_count=('total_net_pnl', lambda data: len([x for x in data if x < 0])),
    pnl_positive_mean=('total_net_pnl', positive_mean),
    pnl_negative_mean=('total_net_pnl', lambda data: np.mean([x for x in data if x < 0])),
    pnl_sum=('total_net_pnl', 'sum'),
    total_trade_count=('total_trade_count', 'sum'),
)
'''

grouped by two columns:
    Pclass  Survived  CategorySize
0       1         0            80
1       1         1           136
2       2         0            97
3       2         1            87
4       3         0           372
5       3         1           119
   Pclass  CategorySize  Survived
0       1           216         1
1       2           184         1
2       3           491         1
   Pclass  min_height  max_weight
0       1          80         136
1       2          87          97
2       3         119         372

"\ndf_group = merged_df.groupby(by=['市值'], as_index=False).agg(\n    pnl_positive_count=('total_net_pnl', add_large_zero),\n    pnl_negative_count=('total_net_pnl', lambda data: len([x for x in data if x < 0])),\n    pnl_positive_mean=('total_net_pnl', positive_mean),\n    pnl_negative_mean=('total_net_pnl', lambda data: np.mean([x for x in data if x < 0])),\n    pnl_sum=('total_net_pnl', 'sum'),\n    total_trade_count=('total_trade_count', 'sum'),\n)\n"

# 计算

## shift

## diff

## pct_change

## cumsum
* 累计和
## cumprod
* 累计乘积
* 
## cut

In [8]:
import pandas as pd
data = [12,5,8,2,8,2,8,2,8,2,8,5,84]
data1 = [12,5,8,56,57,58,59,22,84,24,85,56,87]
df1=pd.DataFrame(data, columns=['num'])
df2=pd.DataFrame(data1, columns=['num'])
print(data1)
df=pd.DataFrame(data, columns=['num'])

df.ta.

df.sort_values(by=['num'], ascending=True, inplace=True) #1升序排序 0降序
# 排序函数
df['cum']=df['num'].cumsum()
df['prod']=df['num'].cumprod()
df['shift-1'] = df['num'].shift(-1)
df['shift+1'] = df['num'].shift(1)
df['diff-1'] = df['num'].diff(-1)
df['pct'] = df['num'].pct_change()

# 多个DataFrame 上下合并操作，append操作
df3 = df1.append(df2) # index不连续index是可以重复的，需要得新设置index索引值
df4 = df1.append(df2, ignore_index=True) #ignore_index 重新设置index
print(df4)
# 对数据进行去重
df4.drop_duplicates(subset=['num'],
                    keep='first', #first 只保留第一行出现的值，last最后一行的值 ，false一行都不保留
                    inplace=True
                    )
print('first22', df4)

[12, 5, 8, 56, 57, 58, 59, 22, 84, 24, 85, 56, 87]
    num  cum         prod  shift-1  shift+1  diff-1  pct
3     2    2            2      2.0      NaN     0.0  NaN
5     2    4            4      2.0      2.0     0.0  0.0
7     2    6            8      2.0      2.0     0.0  0.0
9     2    8           16      5.0      2.0    -3.0  0.0
1     5   13           80      5.0      2.0     0.0  1.5
11    5   18          400      8.0      5.0    -3.0  0.0
2     8   26         3200      8.0      5.0     0.0  0.6
4     8   34        25600      8.0      8.0     0.0  0.0
6     8   42       204800      8.0      8.0     0.0  0.0
8     8   50      1638400      8.0      8.0     0.0  0.0
10    8   58     13107200     12.0      8.0    -4.0  0.0
0    12   70    157286400     84.0      8.0   -72.0  0.5
12   84  154  13212057600      NaN     12.0     NaN  6.0
    num
0    12
1     5
2     8
3     2
4     8
5     2
6     8
7     2
8     8
9     2
10    8
11    5
12   84
13   12
14    5
15    8
16   56
17   57
18   58
19   59
20   22
21   84
22   24
23   85
24   56
25   87
first22     num
0    12
1     5
2     8
3     2
12   84
16   56
17   57
18   58
19   59
20   22
22   24
23   85
25   87

C:\Users\73915\AppData\Local\Temp\ipykernel_45176\3036774247.py:20: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df3=df1.append(df2) # index不连续index是可以重复的，需要得新设置index索引值
C:\Users\73915\AppData\Local\Temp\ipykernel_45176\3036774247.py:21: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df4=df1.append(df2, ignore_index=True) #ignore_index 重新设置index

# Read and write

## read a column as string
```
df_basic = pd.read_csv(stock_basic_csv, dtype={'columnA': str})
```

# others

## How to print an entire Pandas DataFrame in Python?

- https://www.geeksforgeeks.org/how-to-print-an-entire-pandas-dataframe-in-python/

## make pandas display width lagger in jupyter

- pd.set_option('display.width', 800)
- pd.set_option("max_rows", 100)
- pd.set_option("max_columns", 20)

# awesome python libray coupled with pandas
## pandas_datareader
* lots of finacial data api for oversea equities used with pandas

## pandas_ta 
* an easy to use library that leverages the Pandas library with more than 130 financial Indicators and Utility functions. 
* almost with no extra code for computing the indicators, just comes with pandas dataframe with simple dict config.
* tutorial
  * https://morioh.com/p/0aa3e75ff555
  * https://technical-analysis-library-in-python.readthedocs.io/en/latest/

## Bamboolib 
* jupyter 中图形化读入excel
* 你可以使用 Bamboolib，查看它生成的代码，并从中学习。

# trouble shooting

##  SettingWithCopyWarning

* 原因是修改了Dataframe 的view，使用copy就可避免
* df1 = daily_df[daily_df.trade_count > 0.].copy()
* 解决方案2： 

```python
import warnings
from pandas.core.common import SettingWithCopyWarning
warnings.simplefilter(action="ignore", category=SettingWithCopyWarning)
```